# Pandas Serisi Oluşturmak #

In [159]:
import pandas as pd

In [160]:
seri = pd.Series([10,23,34,45,52]) #ilk column index

In [161]:
 type(seri)

pandas.core.series.Series

In [162]:
seri.axes #access index

[RangeIndex(start=0, stop=5, step=1)]

In [163]:
seri.dtype

dtype('int64')

In [164]:
seri.size

5

In [165]:
seri.ndim

1

In [166]:
seri.values

array([10, 23, 34, 45, 52])

In [167]:
seri.head(3) # first 3 row

0    10
1    23
2    34
dtype: int64

In [168]:
seri.tail(3) # last 3 row

2    34
3    45
4    52
dtype: int64

## Index isimlendirilmesi  ##

In [169]:
pd.Series([99,22,332,94,5],index=[1,3,5,7,9])

1     99
3     22
5    332
7     94
9      5
dtype: int64

In [170]:
seri = pd.Series([99,22,332,94,5],index=['a','b','c','d','e'])
seri

a     99
b     22
c    332
d     94
e      5
dtype: int64

In [171]:
seri["a"]

99

In [172]:
seri["a" : "c"]

a     99
b     22
c    332
dtype: int64

In [173]:
# sözlük üzerinden liste oluşturmak

In [174]:
sozluk = {"reg" : 10,"log" : 11,"cart" :12}

In [175]:
seri = pd.Series(sozluk)
seri

cart    12
log     11
reg     10
dtype: int64

In [176]:
#iki seriyi birleştirerek seri oluşturmak

In [177]:
pd.concat([seri,seri])

cart    12
log     11
reg     10
cart    12
log     11
reg     10
dtype: int64

# Eleman İşlemleri #

In [178]:
import numpy as np

In [179]:
a = np.array([1,2,33,45,68,21])
seri = pd.Series(a)
seri

0     1
1     2
2    33
3    45
4    68
5    21
dtype: int64

In [180]:
seri[0]

1

In [181]:
seri[0:3]

0     1
1     2
2    33
dtype: int64

In [182]:
seri = pd.Series([121,200,150,99],index=["reg","loj","cart","rf"])
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [183]:
seri.index

Index([u'reg', u'loj', u'cart', u'rf'], dtype='object')

In [184]:
seri.keys

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

In [185]:
list(seri.items())

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

In [186]:
seri.values

array([121, 200, 150,  99])

In [187]:
#eleman sorgulama

In [188]:
'reg' in seri

True

In [189]:
'a' in seri

False

In [190]:
#fancy ile eleman seçme

In [191]:
seri[['rf','reg']]

rf      99
reg    121
dtype: int64

In [192]:
seri['reg'] = 130
seri['reg']

130

In [193]:
seri['reg' : 'loj']

reg    130
loj    200
dtype: int64

# Pandas Dataframe Oluşturma #

In [194]:
l = [1,2,39,67,90]
l

[1, 2, 39, 67, 90]

In [195]:
import numpy as np
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [196]:
df = pd.DataFrame(m,columns=['var1','var2','var3'])
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [197]:
df.columns

Index([u'var1', u'var2', u'var3'], dtype='object')

In [198]:
df.columns = ('deg1','deg2','deg3')
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [199]:
type(df)

pandas.core.frame.DataFrame

In [200]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index([u'deg1', u'deg2', u'deg3'], dtype='object')]

In [201]:
df.shape

(3, 3)

In [202]:
df.ndim

2

In [203]:
df.size

9

In [204]:
df.values # it is converted to numpy array

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [205]:
df.head(2)

   deg1  deg2  deg3
0     1     2     3
1     4     5     6

In [206]:
df.tail(2)

   deg1  deg2  deg3
1     4     5     6
2     7     8     9

In [207]:
a = np.array([1,2,3,4,5])

In [208]:
pd.DataFrame(a,columns=['deg1'])

   deg1
0     1
1     2
2     3
3     4
4     5

## Eleman İşlemleri ##

In [209]:
s1 = np.random.randint(10,size=5)
s2 = np.random.randint(10,size=5)
s3 = np.random.randint(10,size=5)

sozluk = {'var1' : s1 , 'var2' : s2, 'var3' :s3}

In [210]:
sozluk

{'var1': array([0, 9, 2, 2, 9]),
 'var2': array([6, 3, 3, 9, 2]),
 'var3': array([6, 2, 6, 4, 3])}

In [211]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     0     6     6
1     9     3     2
2     2     3     6
3     2     9     4
4     9     2     3

In [212]:
df.index = ['a','b','c','d','e']
df

   var1  var2  var3
a     0     6     6
b     9     3     2
c     2     3     6
d     2     9     4
e     9     2     3

In [213]:
df['a':'e']

   var1  var2  var3
a     0     6     6
b     9     3     2
c     2     3     6
d     2     9     4
e     9     2     3

In [214]:
df.drop('a',axis=0,inplace=True) # index,axis (0=>row | 1=>column) 
#inplace (changes original dataframe)

In [215]:
df

   var1  var2  var3
b     9     3     2
c     2     3     6
d     2     9     4
e     9     2     3

In [216]:
#fancy ile

In [217]:
l = ['c','e'] # will drop

In [218]:
df.drop(l,axis=0)

   var1  var2  var3
b     9     3     2
d     2     9     4

In [219]:
#degiskenler için drop

In [220]:
df.drop(['var1','var2'],axis=1)

   var3
b     2
c     6
d     4
e     3

In [221]:
'var1' in df

True

In [222]:
l = ['var1','var4','var2'] # var4 not exists in our dataframe

In [223]:
for i in l:
    print(i in df)

True
False
True

In [224]:
df['var1']

b    9
c    2
d    2
e    9
Name: var1, dtype: int64

In [225]:
df['var4'] = df['var1'] / df['var2']
df

   var1  var2  var3      var4
b     9     3     2  3.000000
c     2     3     6  0.666667
d     2     9     4  0.222222
e     9     2     3  4.500000

# Gözlem ve Değişken Seçimi : loc & iloc #

In [226]:
m = np.random.randint(1,30,size=(10,3))
df = pd.DataFrame(m,columns = ['var1','var2','var3'])
df

   var1  var2  var3
0    13    24    26
1    21    19    23
2    19     8     4
3     7    21    16
4    16    10     6
5    29     7    18
6    17    14    28
7    28    25    29
8    28     2    24
9     5     3     8

In [227]:
#loc : tanımlandığı şekli ile seçim yapmak için kullanılır.

In [228]:
df.loc[0:3] #tanımlanmadaki indexleme ile seçim yapıldı / 0:3 => 0,1,2,3

   var1  var2  var3
0    13    24    26
1    21    19    23
2    19     8     4
3     7    21    16

In [229]:
#loc : lokasyon bazlı işlem yapılabilir (column name verilerek spesifik bir column seçilebilir)

In [230]:
df.loc[0:3,'var1']

0    13
1    21
2    19
3     7
Name: var1, dtype: int64

In [231]:
#iloc : alışık olduğumuz indexleme mantığı ile seçim yapar.

In [232]:
df.iloc[0:3] # 0:3 => 0,1,2

   var1  var2  var3
0    13    24    26
1    21    19    23
2    19     8     4

In [233]:
#iloc : lokasyon bazlı işlem yapılamaz (column name verilecek sadece bir column seçilemez sadece index aralığı verilebilir)
# herhangi bir spesifik bir column'u istiyorsanız bu columnun index numarasını bilmeniz gerek.

In [234]:
df.iloc[0:3,0]

0    13
1    21
2    19
Name: var1, dtype: int64

In [235]:
#örnekler

In [236]:
df.iloc[:3,:2]

   var1  var2
0    13    24
1    21    19
2    19     8

In [237]:
df.loc[0:3,'var3'] # 0:3 => 0,1,2,3

0    26
1    23
2     4
3    16
Name: var3, dtype: int64

# Koşullu Eleman İşlemleri #

In [238]:
m = np.random.randint(1,30,size=(10,3))
df = pd.DataFrame(m,columns=['var1','var2','var3'])
df

   var1  var2  var3
0    14     6    13
1    11     9    24
2     7    12    29
3    20    10     9
4     7    28     8
5    23    21    18
6    24    19    15
7    16     7    24
8    22    15    12
9     3    14     6

In [239]:
df[0:2][['var1','var2']] #fancy ve slice

   var1  var2
0    14     6
1    11     9

In [240]:
df.var1

0    14
1    11
2     7
3    20
4     7
5    23
6    24
7    16
8    22
9     3
Name: var1, dtype: int64

In [241]:
df[df.var1 > 15]['var1'] #var1 değeri 15 den büyük olanları verir.

3    20
5    23
6    24
7    16
8    22
Name: var1, dtype: int64

In [242]:
df[(df.var1 > 15) & (df.var2 > 10)] #var1 değeri 15'den büyük ve var2 değeri 10'dan büyük olanları alalım.

   var1  var2  var3
5    23    21    18
6    24    19    15
8    22    15    12

In [243]:
df.loc[(df.var1 > 15),['var1','var2']] #loc ile de koşul yapabiliriz. ve loc ile spesifik bir column alabiliriz.

   var1  var2
3    20    10
5    23    21
6    24    19
7    16     7
8    22    15

In [244]:
df[(df.var1 > 15)][['var1','var2']] #alternative

   var1  var2
3    20    10
5    23    21
6    24    19
7    16     7
8    22    15

# Birleştirme (Join) işlemleri #

In [245]:
m = np.random.randint(1,30,size=(5,3))
df1 = pd.DataFrame(m,columns=['var1', 'var2','var3'])
df1

   var1  var2  var3
0    29    22    13
1     8    26    27
2    11     1    14
3     1    15    16
4    14    23    12

In [246]:
df2 = df1 + 99
df2

   var1  var2  var3
0   128   121   112
1   107   125   126
2   110   100   113
3   100   114   115
4   113   122   111

In [247]:
pd.concat([df1,df2]) #index non-resetted

   var1  var2  var3
0    29    22    13
1     8    26    27
2    11     1    14
3     1    15    16
4    14    23    12
0   128   121   112
1   107   125   126
2   110   100   113
3   100   114   115
4   113   122   111

In [248]:
pd.concat([df1,df2],ignore_index=True) # with index resetted

   var1  var2  var3
0    29    22    13
1     8    26    27
2    11     1    14
3     1    15    16
4    14    23    12
5   128   121   112
6   107   125   126
7   110   100   113
8   100   114   115
9   113   122   111

In [249]:
# farklı columnlara sahip olan 2 dataframe birleştirmek

In [250]:
df2.columns = ['var1','var2','deg3']

In [251]:
pd.concat([df1,df2]) # 2 farklı column olunca birleştirmek mantıklı olmaz.

/home/bodur/.local/lib/python2.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    deg3  var1  var2  var3
0    NaN    29    22  13.0
1    NaN     8    26  27.0
2    NaN    11     1  14.0
3    NaN     1    15  16.0
4    NaN    14    23  12.0
0  112.0   128   121   NaN
1  126.0   107   125   NaN
2  113.0   110   100   NaN
3  115.0   100   114   NaN
4  111.0   113   122   NaN

In [252]:
pd.concat([df1,df2],join_axes=[df1.columns],ignore_index=True)

   var1  var2  var3
0    29    22  13.0
1     8    26  27.0
2    11     1  14.0
3     1    15  16.0
4    14    23  12.0
5   128   121   NaN
6   107   125   NaN
7   110   100   NaN
8   100   114   NaN
9   113   122   NaN

# İleri Birleştirme İşlemleri #

In [253]:
data = {'calisanlar' : ['Ayse','Ali','Veli','Fatma'],'grup' : ['Muhasebe','Muhendislik','Muhendislik','İK']}

df1 = pd.DataFrame(data)

df1

  calisanlar         grup
0       Ayse     Muhasebe
1        Ali  Muhendislik
2       Veli  Muhendislik
3      Fatma           İK

In [254]:
data = {'calisanlar' : ['Ayse','Ali','Veli','Fatma'],'ilk_giris' : [2010,2009,2014,2019]}

df2 = pd.DataFrame(data)

df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [255]:
pd.merge(df1,df2) # birebir birleştirme 
# on parametresi default olarak kendisi columnlar arasında benzerlik yakalayıp birleştirir.

  calisanlar         grup  ilk_giris
0       Ayse     Muhasebe       2010
1        Ali  Muhendislik       2009
2       Veli  Muhendislik       2014
3      Fatma           İK       2019

In [256]:
# yada biz kendimiz belirtebiliriz.
pd.merge(df1,df2,on='calisanlar')

  calisanlar         grup  ilk_giris
0       Ayse     Muhasebe       2010
1        Ali  Muhendislik       2009
2       Veli  Muhendislik       2014
3      Fatma           İK       2019

In [257]:
# Çoktan Teke

In [258]:
df3 = pd.merge(df1,df2)
df3

  calisanlar         grup  ilk_giris
0       Ayse     Muhasebe       2010
1        Ali  Muhendislik       2009
2       Veli  Muhendislik       2014
3      Fatma           İK       2019

In [259]:
data = {'grup' : ['Muhasebe','Muhendislik','İK'],'mudur' : ['Caner','Mustafa','Berkcan']}

df4 = pd.DataFrame(data)

df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           İK  Berkcan

In [260]:
pd.merge(df3,df4) # çok olan gruptaki benzerlikleri kullanarak tek olanı doldurdu.

  calisanlar         grup  ilk_giris    mudur
0       Ayse     Muhasebe       2010    Caner
1        Ali  Muhendislik       2009  Mustafa
2       Veli  Muhendislik       2014  Mustafa
3      Fatma           İK       2019  Berkcan

In [261]:
# Çoktan Çoka

In [262]:
data = {'grup' : ['Muhasebe','Muhasebe','Muhendislik','Muhendislik','İK','İK'],'yetenekler' : ['matematik','excel','kodlama','linux','excel','yonetim']}

df5 = pd.DataFrame(data)

df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           İK      excel
5           İK    yonetim

In [263]:
df1

  calisanlar         grup
0       Ayse     Muhasebe
1        Ali  Muhendislik
2       Veli  Muhendislik
3      Fatma           İK

In [264]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0       Ayse     Muhasebe  matematik
1       Ayse     Muhasebe      excel
2        Ali  Muhendislik    kodlama
3        Ali  Muhendislik      linux
4       Veli  Muhendislik    kodlama
5       Veli  Muhendislik      linux
6      Fatma           İK      excel
7      Fatma           İK    yonetim

# Toplulaştırma ve Gruplandırma (Aggregation & Grouping) #

In [265]:
import seaborn as sns

In [266]:
df = sns.load_dataset('planets') # seaborn bazı hazır datasetlere sahiptir.
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [267]:
df.shape

(1035, 6)

In [268]:
df.mean() # all columns

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [269]:
df['distance'].mean()

264.06928217821786

In [270]:
df['distance'].count()

808

In [271]:
df['distance'].min()

1.35

In [272]:
df['distance'].max()

8500.0

In [273]:
df['distance'].std()

733.1164929404421

In [274]:
df['distance'].var()

537459.7922212933

In [275]:
df.describe() # tüm dağılım ve merkezi dağılım istatistiklerini tanımlamak anlamında sunan bir fonksiyondur.

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [276]:
df.describe().T # tüm dağılım ve merkezi dağılım istatistiklerini tanımlamak anlamında sunan bir fonksiyondur.

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [277]:
# eksik olan satırları atıp daha temiz bir dataset ile bu değerleri görmek için.

df.dropna().describe().T # dropna 'nan' değerine sahip satırları ignore eder.

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

# Gruplama İşlemleri #

In [278]:
df = pd.DataFrame({'gruplar' : ['A','B','C','A','B','C'],'veri' : [10,11,52,23,43,55]} ,columns = ['gruplar','veri'])

df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [279]:
# gruplama işlemleri ile verisetimizdeki group tanımına uyan kategorik bir değişkene göre verileri ayrı kümelere ayırabiliriz.
# böylece group özelliklerini ortaya çıkarabiliriz.

df.groupby('gruplar') #buradaki kategorik group değişkeni 'gruplar'

In [280]:
df.groupby('gruplar').sum() # her grubun toplam değeri.

         veri
gruplar
A          33
B          54
C         107

In [281]:
df.groupby('gruplar').mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [282]:
# seaborn hazır datasetlerinde de bakalım...

df = sns.load_dataset('planets')
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [283]:
df.groupby('method') # method değişkeni gruplanabilir bir kategorik değişken

In [284]:
df.groupby('method')['distance'] # grupların herhangi bir değişken özelliğini görebilmek için subscript yöntemi ile bir değişken seçelim

In [285]:
df.groupby('method')['distance'].sum()

method
Astrometry                           35.75
Eclipse Timing Variations          1261.44
Imaging                            2166.91
Microlensing                      41440.00
Orbital Brightness Modulation      2360.00
Pulsar Timing                      1200.00
Pulsation Timing Variations           0.00
Radial Velocity                   27348.11
Transit                          134242.77
Transit Timing Variations          3313.00
Name: distance, dtype: float64

In [286]:
df.groupby('method')['distance'].mean()

method
Astrometry                         17.875000
Eclipse Timing Variations         315.360000
Imaging                            67.715937
Microlensing                     4144.000000
Orbital Brightness Modulation    1180.000000
Pulsar Timing                    1200.000000
Pulsation Timing Variations              NaN
Radial Velocity                    51.600208
Transit                           599.298080
Transit Timing Variations        1104.333333
Name: distance, dtype: float64

In [287]:
df.groupby('method')['distance'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,17.875000,4.094148,14.98,16.4275,17.875,19.3225,20.77
Eclipse Timing Variations,4.0,315.360000,213.203907,130.72,130.7200,315.360,500.0000,500.00
Imaging,32.0,67.715937,53.736817,7.69,22.1450,40.395,132.6975,165.00
Microlensing,10.0,4144.000000,2076.611556,1760.00,2627.5000,3840.000,4747.5000,7720.00
Orbital Brightness Modulation,2.0,1180.000000,0.000000,1180.00,1180.0000,1180.000,1180.0000,1180.00
Pulsar Timing,1.0,1200.000000,NaN,1200.00,1200.0000,1200.000,1200.0000,1200.00
Pulsation Timing Variations,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Radial Velocity,530.0,51.600208,45.559381,1.35,24.4125,40.445,59.2175,354.00
Transit,224.0,599.298080,913.876990,38.00,200.0000,341.000,650.0000,8500.00
Transit Timing Variations,3.0,1104.333333,915.819487,339.00,597.0000,855.000,1487.0000,2119.00

# İleri Toplulaştırma İşlemleri (Aggregate,filter,transform,apply) #

In [288]:
# bazen pandas içindeki hazır yapılaştırma fonskiyonları yeterli gelmediğinden kendimiz custom yapılaştırma yöntemleri uygulamamız gerekebilir.

df = pd.DataFrame({'gruplar' : ['A','B','C','A','B','C'],'degisken1' : [10,23,33,22,11,99],'degisken2' : [100,253,333,262,111,969]},columns = ['gruplar','degisken1','degisken2'])

df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [289]:
#aggregate

In [290]:
df.groupby('gruplar').mean() #normalde bu şekilde standart bir methodu kullanıyoruz.

         degisken1  degisken2
gruplar
A               16        181
B               17        182
C               66        651

In [291]:
df.groupby('gruplar').aggregate(['max',np.median,'min']) #aggregate verdiğimiz custom functionları her bir variable'a ayrı ayrı uyguladı.

# aggregate pandas içinde olan methodları tırnak içinde yazdığımızda algılar. 
# Farklı bir kütüphaneden import edilen bir methodu kütüphane adıyla belirtmemiz gerekli

        degisken1            degisken2
              max median min       max median  min
gruplar
A              22     16  10       262    181  100
B              23     17  11       253    182  111
C              99     66  33       969    651  333

In [292]:
df.groupby('gruplar').aggregate({'degisken1' : 'min' , 'degisken2' : 'max'}) # her bir değişkene farklı methodlar uygulamak istiyorsak 
# dict kalıbında parametre vermeliyiz

         degisken2  degisken1
gruplar
A              262         10
B              253         11
C              969         33

In [293]:
# filter => gelişmiş filtreleme yöntemleri
# normal pandas filtrelemesi sizin datasetinize göre işlevsiz kaldığında custom fonksiyonlar yazarak oluşturulur.

In [294]:
def custom_filter(x):
    return x['degisken1'].std() > 9

In [295]:
df.groupby('gruplar').filter(custom_filter)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [296]:
# tansform => gelişmiş değişkenleri dönüştürme methodları uygulama yöntemi.
# basit transform örnek
df['degisken1'] * 9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [297]:
df_a = df.loc[:,['degisken1','degisken2']].copy() # gruplar değişkeni kategorik değişken olduğundan ondan kurtulduk.

df_a

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [298]:
df_a.transform(lambda x : x - x.mean())

   degisken1  degisken2
0      -23.0     -238.0
1      -10.0      -85.0
2        0.0       -5.0
3      -11.0      -76.0
4      -22.0     -227.0
5       66.0      631.0

In [299]:
# apply => veri setinin değişkenleri üzerinde gezinen bir methodtur.

In [300]:
df_a = df.loc[:,['degisken1','degisken2']].copy() # gruplar değişkeni kategorik değişken olduğundan ondan kurtulduk.

df_a

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [301]:
df_a.apply(np.sum) # verilen bir lambda fonksiyonunu her bir değişkene kolayca uyguladık.

degisken1     198
degisken2    2028
dtype: int64

In [302]:
df_a.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64

In [303]:
# apply - grup bazlı çalışma

In [304]:
df.groupby('gruplar').apply(np.sum) # grupları bir araya getirdi ve değişkenler üzerinde gezdi

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

In [305]:
df.groupby('gruplar').apply(np.mean)

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

# Pivot Tablolar #

In [308]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [313]:
titanic.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [315]:
# pivot tablolar 2 tane kategorik değişken ve 1 tane sürekli değişkene bağlı olarak
# x - y eksenide kategorik değişkenleri sürekli değişken değerlerine göre dağıtımı sonucu oluşur.

In [325]:
# örnek 

titanic.groupby(['sex','class'])[['survived']].aggregate('mean').unstack()

# örnekte x ekseninde 'class' kategorik değişkeni var
# y ekseninde 'cinsiyet' (sex) değişkeni var

# verilen değerler de survived  değişkeninin bu pivot tablodaki subgroupların mean değerlerini almış

# unstack dağınık haldeki tabloyu tam bir pivot tablo haline getiriyor

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [329]:
# pivot table kolay yolu.

titanic.pivot_table('survived',index='sex',columns='class') # ilk değişken bizim tabloda yer alacak değişkenimiz.
# index => sol tarafı alacak kategorik değişken (y-axis)
# columns => sütunları alacak değişlen (x-axis)

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [331]:
# sürekli değişkenden kategorik değişken oluşturup bunu pivot tabloya eklemek

In [338]:
age_category = pd.cut(titanic['age'],[0,20,100])

In [344]:
titanic.pivot_table('survived', index=['sex',age_category], columns='class') # age_category sonradan oluşturulmuş bir sınıf.

class                First    Second     Third
sex    age
female (0, 20]    0.928571  1.000000  0.510638
       (20, 100]  0.971831  0.896552  0.418182
male   (0, 20]    0.571429  0.526316  0.197368
       (20, 100]  0.382979  0.062500  0.129944

# Dış Kaynaklardan Veri Okumak #

In [393]:
import pandas as pd
import numpy as np
import seaborn as sns

# csv okuma
pd.read_csv('ornekcsv.csv') # veriler ';' ile ayrılmış ama jupyter default olarak ',' algıladığından bunu değiştirmemiz lazım.

       a;b;c
0    78;12;1
1    78;12;2
2   78;324;3
3      7;2;4
4    88;23;5
5       6;2;
6    56;11;6
7     7;12;7
8    56;21;7
9    346;2;8
10     5;1;8
11  456;21;8
12   3;12;88

In [394]:
pd.read_csv('ornekcsv.csv',sep=';') # sep parametresi ile bunu değiştirebiliriz.

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [395]:
# txt okuma
pd.read_csv('duz_metin.txt') #txt ayraç olarak 'boşluk' kullandığından sep gerek yok

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [398]:
pd.read_excel('ornekx.xlsx',engine="openpyxl')

SyntaxError: EOL while scanning string literal (<ipython-input-398-9b33c5a41d80>, line 1)